two_Blade_Case/TwoBlade - A/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (0 -0.5 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    Border
    {
        type            slip;
       
    }
    Hole1
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    Hole2
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
    Overset1
    {
        type            overset;
    }
    Overset2
    {
        type            overset;
    }
    BaseAndTop
    {
        type            empty;
    }
    Outlet
    {
        type            zeroGradient;
        
        
    }
    Inlet
    {
        type            fixedValue;
        value           uniform (0 -0.5 0);
    }
}


// ************************************************************************* //
