two_Blade_Case/TwoBlade - A/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"    
    Border
    {
        type            zeroGradient;
    }
    Hole1
    {
        type            zeroGradient;
    }
    Hole2
    {
        type            zeroGradient;
    }
    Overset1
    {
        type            overset;
    }
    Overset2
    {
        type            overset;
    }
    BaseAndTop
    {
        type            empty;
    }
    Outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    Inlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
