two_Blade_Case/TwoBlade - A/0/include/initialConditions

/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

flowVelocity         (0 -0.5 0);
pressure             0;
turbulentKE          uniform 1.882e-4;
turbulentOmega       0.1210;
#inputMode           merge

// ************************************************************************* //
