two_Blade_Case/TwoBlade - A/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


#include        "include/initialConditions"

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform $turbulentOmega;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(Overset1|Overset2)"
    {
        type            overset;
    }
    BaseAndTop
    {
        type            empty;
    }
    Inlet
    {
        type            fixedValue; //$internalfield ca turbulentKE
        value           $internalField;
    }
    Outlet
    {
        type            zeroGradient;  //zeroGradient probieren

    }

    Border
    {
        type zeroGradient;
    }
    


    "(Hole1|Hole2)"
    {
        type            omegaWallFunction;
        value           $internalField;
    }

}

// ************************************************************************* //
