two_Blade_Case/TwoBlade - A/system/Oscillations
Target			0.2;
Angle			0;
Amplitude_K_P		1;
Amplitude_K_I		5;
Amplitude_K_D		0;
Phi_K_P		0;
Phi_K_I		0;
Phi_K_D		0;
amplitude_begin	0;
Oscillations		1;
